IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_xcmp_regs.xml
<module id="EPWM_XCMP_REGS" HW_revision="" description="EPWM XCMP Registers">
	<register id="XCMPCTL1" width="32" page="1" offset="0x0" internal="0" description="XCMP Mode Control Register">
		<bitfield id="XCMPEN" description="XCMP Compare Register Operation Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XCMPSPLIT" description="XCMP Register Allocation Options " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="XCMPA_ALLOC" description="XCMPn register allocation for CMPA" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="XCMPB_ALLOC" description="XCMPn register allocation for CMPB" begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="XLOADCTL" width="32" page="1" offset="0x8" internal="0" description="XCMP Mode Load Control Register">
		<bitfield id="LOADMODE" description="Load mode selection for Shadow registers" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SHDWLEVEL" description="Shadow Register Level Allocation Options" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SHDWBUFPTR_LOADONCE" description="Register Load event count" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SHDWBUFPTR_LOADMULTIPLE" description="Register Load event count" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="RPTBUF2PRD" description="Repeat Count Shadow Buffer 2" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="RPTBUF2CNT" description="Repeat Count Status Shadow Buffer 2" begin="22" end="20" width="3" rwaccess="R"/>
		<bitfield id="RPTBUF3PRD" description="Repeat Count Shadow Buffer 3" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="RPTBUF3CNT" description="Repeat Count Status Shadow Buffer 3" begin="30" end="28" width="3" rwaccess="R"/>
	</register>
	<register id="XLOAD" width="32" page="1" offset="0xc" internal="0" description="XCMP Mode Load Enable Register">
		<bitfield id="STARTLD" description="Enable register loading of shadow buffers" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FRCLD" description="Force register loading of shadow buffers" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWMXLINKXLOAD" width="32" page="1" offset="0xe" internal="0" description="Link register across PWM modules">
		<bitfield id="XLOADLINK" description="XLOAD  Link Register" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="XREGSHDW1STS" width="32" page="1" offset="0x10" internal="0" description="Shadow Buffer 1 Update Status Register">
		<bitfield id="XCMP1_SHDW1FULL" description="XCMP1_SHDW1 register full Status flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XCMP2_SHDW1FULL" description="XCMP2_SHDW1 register full Status flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="XCMP3_SHDW1FULL" description="XCMP3_SHDW1 register full Status flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="XCMP4_SHDW1FULL" description="XCMP4_SHDW1 register full Status flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="XCMP5_SHDW1FULL" description="XCMP5_SHDW1 register full Status flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="XCMP6_SHDW1FULL" description="XCMP6_SHDW1 register full Status flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="XCMP7_SHDW1FULL" description="XCMP7_SHDW1 register full Status flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="XCMP8_SHDW1FULL" description="XCMP8_SHDW1 register full Status flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="XTBPRD_SHDW1FULL" description="XTBPRD_SHDW1 register full Status flag:" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPC_SHDW1FULL" description="CMPC_SHDW1 register full Status flag:" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPD_SHDW1FULL" description="CMPD_SHDW1 register full Status flag:" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLA_SHDW1FULL" description="XAQCTLA_SHDW1 register full Status flag:" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLB_SHDW1FULL" description="XAQCTLB_SHDW1 register full Status flag:" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="XMAX_SHDW1FULL" description="XMINMAX_SHDW1 register full Status flag:MAX field update" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="XMIN_SHDW1FULL" description="XMINMAX_SHDW1 register full Status flag: MIN field update" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="XREGSHDW2STS" width="32" page="1" offset="0x14" internal="0" description="Shadow Buffer 2 Update Status Register">
		<bitfield id="XCMP1_SHDW2FULL" description="XCMP1_SHDW2 register full Status flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XCMP2_SHDW2FULL" description="XCMP2_SHDW2 register full Status flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="XCMP3_SHDW2FULL" description="XCMP3_SHDW2 register full Status flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="XCMP4_SHDW2FULL" description="XCMP4_SHDW2 register full Status flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="XCMP5_SHDW2FULL" description="XCMP5_SHDW2 register full Status flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="XCMP6_SHDW2FULL" description="XCMP6_SHDW2 register full Status flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="XCMP7_SHDW2FULL" description="XCMP7_SHDW2 register full Status flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="XCMP8_SHDW2FULL" description="XCMP8_SHDW2 register full Status flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="XTBPRD_SHDW2FULL" description="XTBPRD_SHDW2 register full Status flag:" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPC_SHDW2FULL" description="CMPC_SHDW2 register full Status flag:" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPD_SHDW2FULL" description="CMPD_SHDW2 register full Status flag:" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLA_SHDW2FULL" description="XAQCTLA_SHDW2 register full Status flag:" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLB_SHDW2FULL" description="XAQCTLB_SHDW2 register full Status flag:" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="XMAX_SHDW2FULL" description="XMINMAX_SHDW2 register full Status flag:MAX field update" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="XMIN_SHDW2FULL" description="XMINMAX_SHDW2 register full Status flag: MIN field update" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="XREGSHDW3STS" width="32" page="1" offset="0x18" internal="0" description="Shadow Buffer 3 Update Status Register">
		<bitfield id="XCMP1_SHDW3FULL" description="XCMP1_SHDW3 register full Status flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XCMP2_SHDW3FULL" description="XCMP2_SHDW3 register full Status flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="XCMP3_SHDW3FULL" description="XCMP3_SHDW3 register full Status flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="XCMP4_SHDW3FULL" description="XCMP4_SHDW3 register full Status flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="XCMP5_SHDW3FULL" description="XCMP5_SHDW3 register full Status flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="XCMP6_SHDW3FULL" description="XCMP6_SHDW3 register full Status flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="XCMP7_SHDW3FULL" description="XCMP7_SHDW3 register full Status flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="XCMP8_SHDW3FULL" description="XCMP8_SHDW3 register full Status flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="XTBPRD_SHDW3FULL" description="XTBPRD_SHDW3 register full Status flag:" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPC_SHDW3FULL" description="CMPC_SHDW3 register full Status flag:" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPD_SHDW3FULL" description="CMPD_SHDW3 register full Status flag:" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLA_SHDW3FULL" description="XAQCTLA_SHDW3 register full Status flag:" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="XAQCTLB_SHDW3FULL" description="XAQCTLB_SHDW3 register full Status flag:" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="XMAX_SHDW3FULL" description="XMINMAX_SHDW3 register full Status flag:MAX field update" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="XMIN_SHDW3FULL" description="XMINMAX_SHDW3 register full Status flag: MIN field update" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="XCMP1_ACTIVE" width="32" page="1" offset="0x20" internal="0" description="Additional Compare 1 Active Register">
		<bitfield id="XCMP1HR_ACTIVE" description="Additional Compare 1 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP1_ACTIVE" description="Additional Compare 1 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP2_ACTIVE" width="32" page="1" offset="0x22" internal="0" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2HR_ACTIVE" description="Additional Compare 2 Active HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP2_ACTIVE" description="Additional Compare 2 Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
