IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_xcmp_regs.xml
	<register id="XCMP6_SHDW2" width="32" page="1" offset="0x6a" internal="0" description="Additional Compare 6 Shadow 2 Register">
		<bitfield id="XCMP6HR_SHDW2" description="Additional Compare 6 Shadow 2 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP6_SHDW2" description="Additional Compare 6 Shadow 2 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP7_SHDW2" width="32" page="1" offset="0x6c" internal="0" description="Additional Compare 7 Shadow 2 Register">
		<bitfield id="XCMP7HR_SHDW2" description="Additional Compare 7 Shadow 2 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP7_SHDW2" description="Additional Compare 7 Shadow 2 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP8_SHDW2" width="32" page="1" offset="0x6e" internal="0" description="Additional Compare 8 Shadow 2 Register">
		<bitfield id="XCMP8HR_SHDW2" description="Additional Compare 8 Shadow 2 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP8_SHDW2" description="Additional Compare 8 Shadow 2 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XTBPRD_SHDW2" width="32" page="1" offset="0x70" internal="0" description="Additional Time Base Period Shadow 2 Register">
		<bitfield id="XTBPRDHR_SHDW2" description="Additional Time Base Period Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XTBPRD_SHDW2" description="Additional Time Base Period Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XAQCTLA_SHDW2" width="16" page="1" offset="0x74" internal="0" description="XAQCTLA Shadow 2 Register">
		<bitfield id="XCMP1" description="XCMP1 Action" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="XCMP2" description="XCMP2 Action" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="XCMP3" description="XCMP3 Action" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="XCMP4" description="XCMP4 Action" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="XAQCTLB_SHDW2" width="16" page="1" offset="0x75" internal="0" description="XAQCTLB Shadow 2 Register">
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPC_SHDW2" width="16" page="1" offset="0x77" internal="0" description="CMPC Shadow 2 Register">
		<bitfield id="CMPC_SHDW2" description="CMPC Shadow 2 Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPD_SHDW2" width="16" page="1" offset="0x79" internal="0" description="CMPD Shadow 2 Register">
		<bitfield id="CMPD_SHDW2" description="CMPD Shadow 2 Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="XMINMAX_SHDW2" width="32" page="1" offset="0x7e" internal="0" description="XMINMAX Shadow 2 Register">
		<bitfield id="XMAX_SHDW2" description="Maximum Valude  for Capture Counter Active Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XMIN_SHDW2" description="Minimum Valude  for Capture Counter Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP1_SHDW3" width="32" page="1" offset="0x80" internal="0" description="Additional Compare 1 Shadow 3 Register">
		<bitfield id="XCMP1HR_SHDW3" description="Additional Compare 1 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP1_SHDW3" description="Additional Compare 1 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP2_SHDW3" width="32" page="1" offset="0x82" internal="0" description="Additional Compare 2 Shadow 3 Register">
		<bitfield id="XCMP2HR_SHDW3" description="Additional Compare 2 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP2_SHDW3" description="Additional Compare 2 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP3_SHDW3" width="32" page="1" offset="0x84" internal="0" description="Additional Compare 3 Shadow 3 Register">
		<bitfield id="XCMP3HR_SHDW3" description="Additional Compare 3 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP3_SHDW3" description="Additional Compare 3 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP4_SHDW3" width="32" page="1" offset="0x86" internal="0" description="Additional Compare 4 Shadow 3 Register">
		<bitfield id="XCMP4HR_SHDW3" description="Additional Compare 4 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP4_SHDW3" description="Additional Compare 4 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP5_SHDW3" width="32" page="1" offset="0x88" internal="0" description="Additional Compare 5 Shadow 3 Register">
		<bitfield id="XCMP5HR_SHDW3" description="Additional Compare 5 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP5_SHDW3" description="Additional Compare 5 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
