IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_xcmp_regs.xml
	<register id="XCMP6_SHDW3" width="32" page="1" offset="0x8a" internal="0" description="Additional Compare 6 Shadow 3 Register">
		<bitfield id="XCMP6HR_SHDW3" description="Additional Compare 6 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP6_SHDW3" description="Additional Compare 6 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP7_SHDW3" width="32" page="1" offset="0x8c" internal="0" description="Additional Compare 7 Shadow 3 Register">
		<bitfield id="XCMP7HR_SHDW3" description="Additional Compare 7 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP7_SHDW3" description="Additional Compare 7 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XCMP8_SHDW3" width="32" page="1" offset="0x8e" internal="0" description="Additional Compare 8 Shadow 3 Register">
		<bitfield id="XCMP8HR_SHDW3" description="Additional Compare 8 Shadow 3 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XCMP8_SHDW3" description="Additional Compare 8 Shadow 3 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XTBPRD_SHDW3" width="32" page="1" offset="0x90" internal="0" description="Additional Time Base Period Shadow 3 Register">
		<bitfield id="XTBPRDHR_SHDW3" description="Additional Time Base Period Shadow 1 HR Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XTBPRD_SHDW3" description="Additional Time Base Period Shadow 1 Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="XAQCTLA_SHDW3" width="16" page="1" offset="0x94" internal="0" description="XAQCTLA Shadow 3 Register">
		<bitfield id="XCMP1" description="XCMP1 Action" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="XCMP2" description="XCMP2 Action" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="XCMP3" description="XCMP3 Action" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="XCMP4" description="XCMP4 Action" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="XAQCTLB_SHDW3" width="16" page="1" offset="0x95" internal="0" description="XAQCTLB Shadow 3 Register">
		<bitfield id="XCMP5" description="XCMP5 Action" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="XCMP6" description="XCMP6 Action" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="XCMP7" description="XCMP7 Action" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="XCMP8" description="XCMP8 Action" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPC_SHDW3" width="16" page="1" offset="0x97" internal="0" description="CMPC Shadow 3 Register">
		<bitfield id="CMPC_SHDW3" description="CMPC Shadow 3 Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPD_SHDW3" width="16" page="1" offset="0x99" internal="0" description="CMPD Shadow 3 Register">
		<bitfield id="CMPD_SHDW3" description="CMPD Shadow 3 Register" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="XMINMAX_SHDW3" width="32" page="1" offset="0x9e" internal="0" description="XMINMAX Shadow 3 Register">
		<bitfield id="XMAX_SHDW3" description="Maximum Valude  for Capture Counter Active Register" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="XMIN_SHDW3" description="Minimum Valude  for Capture Counter Active Register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
